Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་ཡིག་འབྲུ་གཅིག་གི་ནང་དུ་ཡིག་འབྲུ་མང་པོ་དག་མངོན་པར་སྒྲུབ་ཀྱང་ཡིག་འབྲུ་དེ་ལ་ཡིག་འབྲུ་དེ་དག་མི་སྣང་ངོ་།
en: Moreover, great king, even though one syllable can produce many other syllables, those syllables do not appear in that one syllable.

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་དགེ་སློང་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར་ཞིང་། མང་པོར་གྱུར་ནས་གཅིག་ཏུ་ཡང་འགྱུར་བ་དེ་བཞིན་དུ།
en: Moreover, great king, for a monk who has great miraculous powers, one can be transformed into many, and many can become one.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པས་སྟོབས་དང་། མི་འཇིགས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཐོབ་ནས་སེམས་ཅན་རྣམས་ལ་གདམས་པའི་ཕྱིར་ཆོས་བསྟན་པས་སེམས་ཅན་འདི་སྙེད་ཅིག་དུལ་ལོ་ཞེས་འཇིག་རྟེན་གྱི་ཐ་སྙད་དང་། བགྲང་བའི་ཚུལ་གྱིས་དེ་ལྟར་སྟོན་ཏོ།
en: In the same way, great king, when the thus-gone ones have obtained the powers, fearlessnesses, and all the perfections, they teach the Dharma in order to instruct beings. As they do so, they employ worldly conventions and ways of calculation to declare ‘I have trained such-and-such many beings.’

source: །རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་དུལ་བ་དང་། གང་དག་དུལ་བ་དང་། གང་གིས་དུལ་བ་དེ་དག་ནི་རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་གཉིས་སུ་མེད་པ་ལ་གནས་པ་སྟེ།
en: However, great king, the method of training, those who are trained, and those who do the training are actually nondual from the perspective of the thus-gone ones.

source: ཆོས་འདི་བསྟན་པས་སེམས་ཅན་འདི་སྙེད་ཅིག་དུལ་ལོ་ཞེས་བྱ་བ་དེ་ནི་མ་བྱས་པ། འགྱུར་བ་མེད་པར་སེང་གེའི་སྒྲ་སྒྲོགས་པའོ།
en: Thus, when they say, ‘Through teaching this Dharma, I have trained such-and-such many beings,’ that is the uncreated, unchanging lion’s roar.”

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྟན་པ་འདི་བཤད་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་འགུལ།
en: When the thus-gone, worthy, perfect Buddha gave this teaching, the worlds of the great trichiliocosm shook six times.

source: རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ་ཏོ། །གཡོས་རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ། །
en: They quivered, trembled, and quaked; wobbled, rocked, and swayed; and vibrated, shuddered, and reeled.

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་དོག་ས་ཆེར་གཡོས་པར་གྱུར་པའི་རྒྱུ་ནི་གང་ལགས།
en: King Prasenajit of Kośala now asked the Blessed One, “Blessed One, what is the cause for the earth to shake so strongly?

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པས་བསྟན་པ་འདི་བཤད་པ་ན་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་ཐེར་འབུམ་ཕྲག་འབུམ་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: The Blessed One responded, “Great king, when the Thus-Gone One gave this teaching, eight quadrillion gods of the desire realm and the form realm attained the purified Dharma eye, free from dust and blemish with respect to phenomena.

source: །ལྷ་ཐེར་འབུམ་ཕྲག་དགུ་བཅུ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: Ninety billion gods developed acceptance of the unborn nature of phenomena.

source: །བྲམ་ཟེ་སྟོང་ཕྲག་དྲུག་ཅུ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: Sixty thousand brahmins attained the purified Dharma eye, free from dust and blemish with respect to phenomena.

source: །སྲོག་ཆགས་ལྷ་དང་མིར་བཅས་པ་བརྒྱད་ཁྲི་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ།
en: Eighty thousand beings, including gods and humans, attained the purified Dharma eye with respect to phenomena.

source: །སྲོག་ཆགས་མིའི་སྐྱེ་དགུ་སྟོང་ཕྲག་དྲུག་ཁྲི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: Eighty million human beings developed acceptance of the unborn nature of phenomena.

source: །སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་སྟོང་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱེད་དོ།
en: Eight million creatures directly perceived the fruition of the non-returners.

source: །རྒྱལ་པོ་ཆེན་པོ་འཇིག་རྟེན་དུ་ས་ཆེར་གཡོས་པར་གྱུར་པའི་རྒྱུ་ནི་དེ་ཡིན་ནོ།
en: Great king, that is the cause for the earth to shake so strongly.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནམ་མཁའ་དང་ལྡན་པའི་ས་ཕྱོགས་འདི་ཉིད་དུ་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་བཤད་དོ།
en: Great king, the blessed buddhas of the past also gave this Dharma teaching on the conversations of thus-gone ones in this very place under the sky.

source: །ང་ཡང་འཆད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ཡང་ས་ཕྱོགས་འདི་ཉིད་དུ་འཆད་པར་འགྱུར་རོ།
en: I am also giving it, and the thus-gone, worthy, perfect Buddha Maitreya will also teach it in this very place.”

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་སྣ་ཚོགས་དེ་དག་གིས་མངོན་པར་གཏོར་ཏོ།
en: To worship this Dharma teaching, King Prasenajit of Kośala then sprinkled, scattered, and tossed a variety of flowers, perfume, and garlands on the Thus-Gone One.

source: །རབ་ཏུ་གཏོར་ཏོ། །རབ་ཏུ་མངོན་པར་གཏོར་ནས་ཚིག་འདི་སྐད་དུ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པར་འདོད་པས་ནི་དེ་བཞིན་གཤེགས་པ་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པར་བྱའོ་ཞེས་སྨྲས་སོ།
en: He then said, “If one wishes to make offerings to the blessed buddhas of the past, future, and present, one should make offerings to this Dharma teaching on the discussions about thus-gone ones.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་སྨྲས་པ། ལྷའི་བུ་དག་ཚུར་ཤེག །
en: Śakra, king of the gods, then said to the gods of the Heaven of the Thirty-Three, “Come here, gods.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དག་གིས་གཏོར་བར་བྱའོ། །མངོན་པར་གཏོར་བར་བྱའོ། །མངོན་པར་རབ་ཏུ་གཏོར་བར་བྱའོ། །
en: In order to worship this Dharma teaching, one must scatter, sprinkle, and toss divine flowers, incense, perfume, garlands, and sandalwood powder.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: གྲོགས་པོ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བྱས་པས་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱས་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because, friends, by worshiping this Dharma teaching, one is worshiping the blessed buddhas of the past, future, and present.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ། མེ་ཏོག་མན་དཱ་ར་བས་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ། །སྟེང་གི་བར་སྣང་ལས་ཀྱང་ལྷའི་རོལ་མོའི་སྒྲ་བསྒྲགས་སོ།
en: Śakra, king of the gods, together with the gods of the Heaven of the Thirty-Three, then sprinkled and scattered māndārava flowers on the Blessed One, and divine music resounded from the sky.

source: །དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ཐམས་ཅད་དང་ལྡན་པའི་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་གྲུབ་པའི་དར་གྱི་ལྡ་ལྡི་དག་གིས་རྒྱས་པར་གྱུར་ལ།
en: In order to worship the Thus-Gone One himself, they filled the entire Jeta Grove with silken streamers decorated with the seven precious materials.

source: ཚིག་འདི་སྐད་དུ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བྱེད་པ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: Then he said, “Those noble sons and daughters who worship this Dharma teaching will be worshiping the blessed buddhas of the past, future, and present.”

source: །དེ་ནས་ཁྱིམ་བདག་དེ་དག་གིས་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་སྣ་ཚོགས་ཇི་ལྟར་ཐོགས་ཐོགས་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏེ། ཚིག་འདི་སྐད་དུ། གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བྱེད་པ་དེ་དག་གིས་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: Next, the householders scattered upon the Blessed One as many flowers, perfumes, and garlands as they could carry and said, “Whoever worships this Dharma teaching will be worshiping the blessed buddhas of the past, future, and present.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཁྱིམ་བདག་དེ་དག་ལ་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ། །
en: The Blessed One then said to King Prasenajit, to Śakra, king of the gods, and to the householders, “Gods, it is just as you have said.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཀློག་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་སྟོན་པར་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པར་བྱེད་པ་དང་། ཐ་ན་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བ་དེ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པར་བྱས་པར་འགྱུར་རོ། །
en: The Blessed One then said to venerable Ānanda, “Ānanda, any noble son, noble daughter, monk, nun, male lay practitioner, or female lay practitioner who remembers this Dharma teaching, retains it, understands it, reads it aloud, teaches it widely to others, practices it correctly, or even writes it down and carries it will be worshiping the blessed buddhas of the past, future, and present.

source: ཀུན་དགའ་བོ་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་བསྟན་ཏོ།
en: Because, Ānanda, all blessed buddhas who appeared as thus-gone, worthy, perfect blessed buddhas in the past all taught this Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma.

source: །ཀུན་དགའ་བོ་མ་འོངས་པའི་དུས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་སྟོན་པར་འགྱུར་རོ།
en: Ānanda, all blessed buddhas who will arise in the future will teach this very Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma.

source: །ཀུན་དགའ་བོ་ད་ལྟར་ཕྱོགས་བཅུ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་སྟོན་ཏོ།
en: Ānanda, all blessed buddhas who currently flourish and prosper in any of the ten directions also teach this Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma.

source: །བསྟན་ཏོ། །སྟོན་པར་འགྱུར་རོ།
en: They have taught it and they will teach it.

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་བསྟན་པ་ནི་ཡང་དག་ཕུལ་ལོ་ཞེས་ཡང་དག་པར་སྨྲ་བས་སྨྲ་ན། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡང་དག་པར་སྨྲ་བས་སྨྲའོ། །
en: Ānanda, if I were to declare which of the Dharma teachings taught by the blessed buddhas is the most excellent, then, Ānanda, it would be this Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma. “

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་། སངས་རྒྱས་ཀྱི་སྟོབས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་མི་འཇིགས་པ་རྣམས་ཚོལ་བར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་གནས་ལ་གནས་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་སྒྲུབ་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་འདོད་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: Ānanda, any noble son or daughter who wishes to attain the wisdom of a buddha, the powers of a buddha, and the fearlessnesses of a buddha, who wishes to abide in a buddha field, who wishes to accomplish the wisdom of a buddha, and who wishes to obtain the wisdom of a buddha should remember this Dharma teaching on the discussions about the thus-gone ones and discussions about the Dharma.

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །འཇུག་པར་གྱིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །
en: They should understand it, engage in it, preserve it, and read it aloud.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐ་ན་གླེགས་བམ་དུ་བྱས་ཏེ། འཆང་བ་དང་། ཀློག་པ་དང་། ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་བརྗོད་ཅིང་འདོན་པ་དེས་རྨི་ལམ་ན་ང་ཆོས་སྟོན་པ་མཐོང་ན་དེའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་དུ་འགྱུར་བ་ནི།
en: Because, Ānanda, any noble son or daughter who even just writes down this Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma and who carries it, reads it aloud, and recites and chants it within two weeks will see me teaching the Dharma in a dream, which will be of benefit related to their qualities. “

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐ་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལའི་རྣ་ལམ་དུ་གྲག་པ་དང་། ཐ་ན་ཐོས་པ་ཙམ་དུ་ཡང་འགྱུར་བ་དང་། ཐོས་ནས་ཀྱང་ཡི་རངས་པར་འགྱུར་ན།
en: Ānanda, as for the benefits, if any noble son or daughter happens to overhear this teaching on the discussions about thus-gone ones and discussions about the Dharma, or if they merely hear it and enjoy hearing it, then, Ānanda, that will result in those noble sons or daughters coming to serve many buddhas.

source: ཀུན་དགའ་བོ་དེས་ན་དེའི་མཐའ་ནི་ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་པར་རྟོགས་པར་བྱ་སྟེ། ཀུན་དགའ་བོ་ཆོས་ཟབ་མོ་འདི་བསྟན་པས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དག་མི་སྐྲག་ཅིང་མི་དངང་ལ་དངང་བར་མི་འགྱུར་བའི་རྣམ་པ་ནི་དེ་ཡིན་ནོ།
en: Ānanda, by teaching this profound Dharma, noble sons and daughters will no longer be afraid, fearful, or gripped by fear.

source: །མཚན་མ་ནི་དེ་ཡིན་ནོ། །རྟགས་ནི་དེ་ཡིན་ནོ། །དབྱིབས་ནི་དེ་ཡིན་ནོ།
en: Such are the features, characteristics, signs, and forms of those benefits. “

source: །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཁ་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས། ཡང་དག་པར་འཇུག །ཡང་དག་པར་འཇུག་པར་འགྱུར་བ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་ཡང་གཟུང་བར་བྱ།
en: Ānanda, those noble sons or daughters who have genuinely entered into unexcelled and perfect awakening, as well as those who are entering into it and those who will enter into it, should remember at least one four-line verse from this Dharma teaching on the discussions about thus-gone ones and discussions about the Dharma.

source: ཀུན་ཆུབ་པར་བྱ། གདོན་པར་བྱ། བཅང་བར་བྱ། གཞན་དག་ལ་ཡང་བཤད་པར་བྱ། བསྟན་པར་བྱ་སྟེ།
en: They should understand it, recite it, preserve it, explain it to others, and teach it.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་མང་དུ་འཕེལ་བར་འགྱུར་རོ།
en: Ānanda, the merit of those noble sons and daughters will then increase greatly.”

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སང་གི་གདུགས་ལ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གི་གདུགས་ཚོད་གསོལ་བར་གནང་བར་མཛད་དུ་གསོལ།
en: Then King Prasenajit of Kośala said to the Blessed One, “Blessed One, please accept my invitation for you and the entire congregation of monks to have your meal at my residence tomorrow.”

source: རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཐུགས་བརྩེ་བར་མཛད་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: Out of compassion for King Prasenajit, the Blessed One remained silent.

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་བགྱི་བ་མང་ཞིང་བགྱིད་པ་མང་བས་མཆི་ལགས་སོ།
en: King Prasenajit of Kośala then said to the Blessed One, “Blessed One, we have many things to do and many things to get done, so we must depart.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said to King Prasenajit, “Great king, if the time has come for that, you should depart.”

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བུད་མེད་གཙོ་མོ་ལ་སྨྲས་པ། བུད་མེད་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ལ། བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་གང་བཤད་པ་དེ་ཐམས་ཅད་ང་ལ་ཡང་ཟློས་ཤིག །
en: King Prasenajit said to his chief queen, “Wife, stay here in the presence of the Blessed One and repeat to me whatever Dharma he teaches.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གུས་པ་དང་བཅས། ཞེ་ས་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་།
en: King Prasenajit then bowed down at the feet of the Blessed One with reverence and respect and left the presence of the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ནས་ཤར་ཕྱོགས་ལོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཡོན་ཏན་ལྡན་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མཆོག་སྒྲུབ་མེ་ཏོག་མངོན་འཕགས་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Blessed One said to youthful Mañjuśrī, “Mañjuśrī, to the east of here is the world known as Suffused with Qualities. There, the thus-gone Exalted Flower King of the Great Array resides, flourishes, and prospers.

source: །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མཆོག་སྒྲུབ་མེ་ཏོག་མངོན་འཕགས་རྒྱལ་པོས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: I asked him, ‘Thus-gone Exalted Flower King of the Great Array, on what basis did you fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །མེ་ཏོག་འདི་གང་ལ་གནས་པ་དེ་ལ་ཆོས་ཐམས་ཅད་གནས་ཏེ།
en: He then said to me, ‘The basis for this flower is the basis for all phenomena.

source: ཁོ་བོ་དེ་ལྟ་བུ་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: It was on such a basis that I fully awakened to unexcelled and perfect buddhahood.’ ”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མེ་ཏོག་དེ་དག་ཅི་ལ་གནས་ལགས།
en: Mañjuśrī asked, “Blessed One, what are flowers based on?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་མེ་ཏོག་དེ་དག་ནི་གནས་མེད་དོ།
en: The Blessed One replied, “Mañjuśrī, flowers have no basis.

source: །འཇམ་དཔལ་མེ་ཏོག་དེ་དག་ནི་རང་བཞིན་གྱི་གནས་ལ་གནས་པ་སྟེ།
en: Mañjuśrī, flowers are based on the natural basis.

source: ཆོས་ཐམས་ཅད་ཀྱང་དེ་ལྟ་བུ་ལ་གནས་པས་བྱང་ཆུབ་དེ་ཡང་དེ་དང་འདྲ་སྟེ། དེ་ལ་བྱེ་བྲག་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: Since all phenomena have a basis like that, awakening also has such a basis, without the slightest difference whatsoever.

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་གཙོ་བོ་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, that thus-gone one asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོ་ཡང་དག་པའི་མཐའ་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་དེ་ནི་ཡིད་ཀྱི་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ།
en: Mañjuśrī, I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the limit of reality.’ Such were the questions in the discussion we had by means of the mind.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཡང་དག་པའི་མཐའ་ཅི་ལ་གནས་ལགས།
en: Then youthful Mañjuśrī asked the Blessed One, “Blessed One, what is the basis of the limit of reality?”

source: བཀའ་སྩལ་པ། དེའི་ཕྱིར་ཁྱོད་ཉིད་ལ་དྲིས།
en: The Blessed One replied, “I will ask you a question in this regard.

source: ཁྱོད་ཇི་ལྟར་བཟོད་པ་དེ་ལྟར་ལན་ཐོབ་ཤིག །
en: Please answer as well as you are able.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་སོས་ཀའི་ཟླ་བ་ཐ་མ་དྲོ་ཞིང་ཚ་བའི་དུས་ལ་བབ་པའི་ཚེ། མི་ཉམ་ཆུང་བ་ཞིག་གིས་སྨིག་རྒྱུ་གཡོ་བ་མཐོང་བ་ལས་དེ་སྐོམ་པར་གྱུར་ལ།
en: Mañjuśrī, to give an analogy, during the midday heat of the last month of spring a feeble person might see a wavering mirage and become thirsty.

source: དེའི་གྲོགས་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་སྨིག་རྒྱུ་དེ་ལ་ཆུར་འདུ་ཤེས་པར་གྱུར་ཏེ། དེ་དག་ཤས་ཆེར་འགྲོ་ཞིང་།
en: His friends might also perceive the mirage as water, so they would all rush to get to it.

source: འདི་ལྟར་སྨིག་རྒྱུ་དེ་ལ་ཆུར་འདུ་ཤེས་པ་རྣམས་ཇི་ལྟ་ཇི་ལྟར་འགྲོ་ཞིང་གང་དུ་འགྲོ་བ་དེ་ལྟ་དེ་ལྟར་དེ་དག་གི་སྐོམ་པ་འཕེལ་བར་འགྱུར་ན།
en: However, the more these people, who in this way perceive the mirage to be water, proceed, the more their thirst grows.

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Mañjuśrī, what do you think?

source: མི་དེ་དག་གི་འདུ་ཤེས་ཡང་དག་པ་ཡིན་ནམ། གསོལ་པ།
en: Is their perception accurate?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: No, Blessed One, it is not.” “

source: ཅི་སྨིག་རྒྱུ་ལ་ཆུ་གནས་སམ། གསོལ་པ།
en: Is there a basis for water in the mirage?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed One, there is not.

source: །སྨིག་རྒྱུ་ལ་ཆབ་ཀྱང་མ་མཆིས་ལགས་ན་གནས་པ་ལྟ་ག་ལ་མཆིས་ཏེ།
en: If there is no water actually present in the mirage, how could there be a basis for it?

source: གནས་པ་མ་མཆིས་པས་བཅོམ་ལྡན་འདས་དེ་ནི་བརྗོད་པར་བགྱི་བ་མ་ལགས་སོ།
en: Since there is no basis, Blessed One, one cannot say so.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་ཡང་དག་པའི་མཐའ་ལ་གནས་ཏེ་བྱང་ཆུབ་དེ་ཡང་དེ་དང་འདྲའོ།
en: The Blessed One said, “Mañjuśrī, in the same way, all phenomena are based on the limit of reality. Awakening is also like that! “

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་སྒྲུབ་བཀོད་དུ་མ་མངོན་འཕགས་རྒྱལ་པོ་ཁྱུ་མཆོག་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་གཙོ་བོ་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Furthermore, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha Manifested Chief Exalted King Arrayed with Invisible Flowers asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ངས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཆོས་ཐམས་ཅད་ལ་གནས་ནས། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of all phenomena.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཅི་ལ་གནས་ལགས། བཀའ་སྩལ་པ།
en: Then youthful Mañjuśrī asked the Blessed One, “Blessed One, what is the basis of all phenomena?” “

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་ལ་ཡང་གནས་ལ།
en: Mañjuśrī, all phenomena are based on their nature, yet they are also not based on their nature.

source: དེ་དག་རང་བཞིན་ལ་གནས་པ་ཡང་མ་ཡིན་ཏེ་བྱང་ཆུབ་དེ་ཡང་དེ་དང་འདྲ་འོ།
en: Awakening is also like that!

source: །འཇམ་དཔལ་གཞན་ཡང་ངས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྒྲུབ་བཀོད་དུ་མ་མངོན་འཕགས་རྒྱལ་པོ་ཁྱུ་མཆོག་རྣམ་པར་རོལ་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, I said to the thus-gone Manifested Chief Exalted King Arrayed with Invisible Flowers, ‘On what basis did the Thus-Gone One fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡང་དག་པའི་མཐའ་གང་ལ་གནས་པ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: He replied to me, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the limit of reality.’

source: དེ་ནི་ཡིད་ཀྱི་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ། །
en: Such were the questions in the discussion we had by means of the mind.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཡང་དག་པའི་མཐའ་ཅི་ལ་གནས་ལགས།
en: Mañjuśrī asked the Blessed One, “Blessed One, what is the basis for the limit of reality?” “

source: བཀའ་སྩལ་པ། མ་འོངས་པའི་མཐའ་དང་། ད་ལྟར་བྱུང་བའི་མཐའ་གང་ལ་གནས་པ་ལྟར་འདས་པའི་མཐའ་ཡང་དེ་ལྟར་གནས་སོ།
en: The basis for the limit of the future and the limit of the present is also the basis for the limit of the past.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ད་ལྟར་བྱུང་བའི་མཐའ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས།
en: Blessed One, what is the meaning of the words the limit of the present?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་འཆི་འཕོ་མེད་ཅིང་མ་སྐྱེས་པ་སྟེ།
en: Mañjuśrī, all phenomena are unborn and undying by nature.

source: དེ་ནི་ད་ལྟར་བྱུང་བའི་མཐའ་ཞེས་བྱའོ།
en: That is the meaning of the limit of the present.” “
